In [1]:
import pandas as pd
import numpy as np

# 1.1 Структура данных Series

In [2]:
shares = {'ММК': 52.50, 'Северсталь': 1386.20, 'НЛМК': 214.20} 

ser = pd.Series(shares, index=['ММК', 'Северсталь'])

ser

ММК             52.5
Северсталь    1386.2
dtype: float64

In [3]:
ser = pd.Series(data=0, index=range(5))

ser

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [4]:
from string import ascii_lowercase

ser = pd.Series(range(1, 8), list(ascii_lowercase[0:7]))

print(ser)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [5]:
[chr(c) for c in range(ord('a'), ord('g') + 1)]

['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [6]:
d = {"Moody's": "США", "Standard & Poor's": "США", "Fitch Ratings": "США",
     "АКРА": "Россия", "Эксперт РА": "Россия", "НРА": "Россия"}
srs = pd.Series(d)
# Продолжите написание кода здесь

srs[::2]

Moody's             США
Fitch Ratings       США
Эксперт РА       Россия
dtype: object

In [7]:
d = {'BANE': 'ПАО АНК "Башнефть"', 'LKOH': 'ПАО "ЛУКОЙЛ"', 
     'NVTK': 'ПАО "НОВАТЭК"', 'ROSN': 'ПАО "НК "Роснефть"',
     'TATN': 'ПАО "Татнефть" им. В.Д.Шашина', 'TRNFL': 'ПАО "Транснефть"'}
srs = pd.Series(d)
# Продолжите написание кода здесь

tickers = ['GAZP', 'SIBN', 'SNGS']
stocks = ['ПАО "Газпром"', 'ПАО "Газпром нефть"', 'ПАО "Сургутнефтегаз"']

for i in range(len(tickers)):
    srs[tickers[i]] = stocks[i]

srs

BANE                ПАО АНК "Башнефть"
LKOH                      ПАО "ЛУКОЙЛ"
NVTK                     ПАО "НОВАТЭК"
ROSN                ПАО "НК "Роснефть"
TATN     ПАО "Татнефть" им. В.Д.Шашина
TRNFL                 ПАО "Транснефть"
GAZP                     ПАО "Газпром"
SIBN               ПАО "Газпром нефть"
SNGS              ПАО "Сургутнефтегаз"
dtype: object

In [8]:
d.update({'GAZP': 'ПАО "Газпром"', 'SIBN': 'ПАО "Газпром нефть"', 'SNGS': 'ПАО "Сургутнефтегаз"'})
srs = pd.Series(d)
srs

BANE                ПАО АНК "Башнефть"
LKOH                      ПАО "ЛУКОЙЛ"
NVTK                     ПАО "НОВАТЭК"
ROSN                ПАО "НК "Роснефть"
TATN     ПАО "Татнефть" им. В.Д.Шашина
TRNFL                 ПАО "Транснефть"
GAZP                     ПАО "Газпром"
SIBN               ПАО "Газпром нефть"
SNGS              ПАО "Сургутнефтегаз"
dtype: object

In [9]:
# Поменяйте местами колонки индексов и значений.
d = {'BSPB': 'ПАО "Банк "Санкт-Петербург"', 'CBOM': 'ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК"', 
     'ROSB': 'ПАО РОСБАНК', 'SBER': 'ПАО Сбербанк',
     'USBN': 'ПАО "БАНК УРАЛСИБ"', 'VTBR': 'Банк ВТБ (ПАО)'}
srs = pd.Series(d)
srs

BSPB        ПАО "Банк "Санкт-Петербург"
CBOM    ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК"
ROSB                        ПАО РОСБАНК
SBER                       ПАО Сбербанк
USBN                 ПАО "БАНК УРАЛСИБ"
VTBR                     Банк ВТБ (ПАО)
dtype: object

In [10]:
pd.Series(srs.index.values, index=srs)

ПАО "Банк "Санкт-Петербург"        BSPB
ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК"    CBOM
ПАО РОСБАНК                        ROSB
ПАО Сбербанк                       SBER
ПАО "БАНК УРАЛСИБ"                 USBN
Банк ВТБ (ПАО)                     VTBR
dtype: object

In [11]:
# Удалите из серии каждое чётное значение.
d = {'AMEZ': 'ПАО "Ашинский метзавод"', 'CHMF': 'ПАО "Северсталь"', 
     'CHMK': 'ПАО "ЧМК"', 'GMKN': 'ПАО "ГМК "Норильский никель"',
     'MAGN': 'ПАО "ММК"', 'MTLR': 'ПАО "Мечел"',
     'NLMK': 'ПАО "НЛМК"', 'RUAL': 'МКПАО "ОК РУСАЛ"',
     'TRMK': 'ПАО "ТМК"'}
srs = pd.Series(d)
srs

AMEZ         ПАО "Ашинский метзавод"
CHMF                ПАО "Северсталь"
CHMK                       ПАО "ЧМК"
GMKN    ПАО "ГМК "Норильский никель"
MAGN                       ПАО "ММК"
MTLR                     ПАО "Мечел"
NLMK                      ПАО "НЛМК"
RUAL                МКПАО "ОК РУСАЛ"
TRMK                       ПАО "ТМК"
dtype: object

In [12]:
print(srs.drop(srs[1::2].index))
print(srs.drop(srs.index[1::2]))

AMEZ    ПАО "Ашинский метзавод"
CHMK                  ПАО "ЧМК"
MAGN                  ПАО "ММК"
NLMK                 ПАО "НЛМК"
TRMK                  ПАО "ТМК"
dtype: object
AMEZ    ПАО "Ашинский метзавод"
CHMK                  ПАО "ЧМК"
MAGN                  ПАО "ММК"
NLMK                 ПАО "НЛМК"
TRMK                  ПАО "ТМК"
dtype: object

In [13]:
d1 = {'2022': 1184477, '2021': 1316948, '2020': 1116969}
srs1 = pd.Series(d1, name='Выручка, в млн рублей')
d2 = {'2022': 426329, '2021': 372728, '2020': 324308}
srs2 = pd.Series(d2, name='Себестоимость реализованных металлов, в млн рублей')
d3 = {'2022': 56137, '2021': 54862, '2020': 40482}
srs3 = pd.Series(d3, name='Себестоимость прочей реализации, в млн рублей')
# Продолжите написание кода здесь
srs = pd.Series(srs1.sub(srs2 + srs3), name = 'Валовая прибыль, в млн рублей')
srs

2022    702011
2021    889358
2020    752179
Name: Валовая прибыль, в млн рублей, dtype: int64

In [14]:
# P/E = Капитализация / Чистая прибыль

# P/E является самым популярным мультипликатором, который сравнивает стоимость компании с главным итогом деятельности - чистой прибылью. 
# В классическом варианте для сравнения берутся капитализация за последний торговый день года и чистая прибыль за этот год.
# По сути, отношений цены к чистой прибыли показывает сумму в рублях, которую инвестор может инвестировать в компанию, чтобы получить один рубль прибыли этой компании.
# При сравнении двух компаний P/E показывает, насколько рубль чистой прибыли одной компании оценивается инвесторами выше, чем рубль чистой прибыли другой. 
# При прочих равных условиях интереснее та компания, у которой значение P/E меньше, а значит есть вероятность того, что она недооценена и ее акции могут расти быстрее.

In [15]:

d1 = {'ПАО "Россети"': 54_210_000_000, 'ПАО "РусГидро"': 19_325_000_000, 
      'ПАО "Юнипро"': 21_267_722_000}
srs1 = pd.Series(d1, name='Чистая прибыль за 2022 год, руб.')
d2 = {'ПАО "Россети"': 110_844_896_493.56, 'ПАО "РусГидро"': 333_200_635_086.47, 
      'ПАО "Юнипро"': 84_863_558_471.17}
srs2 = pd.Series(d2, name='Капитализация на конец 2022 года, в млн рублей')
# Продолжите написание кода здесь

srs = pd.Series(srs2.div(srs1).round(1), name='P/E 2022 год')

print(srs1, srs2, srs, sep='\n\n')

ПАО "Россети"     54210000000
ПАО "РусГидро"    19325000000
ПАО "Юнипро"      21267722000
Name: Чистая прибыль за 2022 год, руб., dtype: int64

ПАО "Россети"     1.108449e+11
ПАО "РусГидро"    3.332006e+11
ПАО "Юнипро"      8.486356e+10
Name: Капитализация на конец 2022 года, в млн рублей, dtype: float64

ПАО "Россети"      2.0
ПАО "РусГидро"    17.2
ПАО "Юнипро"       4.0
Name: P/E 2022 год, dtype: float64

In [16]:
amounts = [300_000, 200_000, 500_000, 700_000, 1_000_000]
days = [30, 60, 90, 120, 180]
rates = [10, 11, 11, 12, 14]
amounts = pd.Series(amounts, name='Сумма депозита')
days = pd.Series(days, name='Дни')
rates = pd.Series(rates, name='Ставки')
# Продолжите написание кода здесь

ser = pd.Series(amounts * (days / 365) * rates * 0.01 + amounts)
ser

0    3.024658e+05
1    2.036164e+05
2    5.135616e+05
3    7.276164e+05
4    1.069041e+06
dtype: float64

In [17]:
lst1 = ['2023-01-01', '2023-02-01', '2023-03-01', '2023-04-01',
        '2023-05-01', '2023-06-01', '2023-07-01', '2023-08-01',]
srs1 = pd.Series(lst1)
srs2 = pd.Series('2020-01-01', index=range(8))
# Продолжите написание кода здесь

srs1 = srs1.astype('datetime64[ns]')
srs2 = srs2.astype('datetime64[ns]')

pd.Series(srs1 - srs2, dtype='timedelta64[ns]')

0   1096 days
1   1127 days
2   1155 days
3   1186 days
4   1216 days
5   1247 days
6   1277 days
7   1308 days
dtype: timedelta64[ns]

In [18]:
# Трейдер выставил биржевые заявки на покупку акций по ценам, представленным в серии srs1. 
# Некоторые из этих заявок исполнились, и в серии srs2 находятся данные по количеству купленных ценных бумаг.

d1 = {'ПАО "Газпром"': 162.5, 'Банк ВТБ (ПАО)': 0.024, 'ПАО "Аэрофлот"': 36.5, 
      'ПАО "Магнит"': 6200, 'ПАО "Газпром нефть"': 830}
d2 = {'ПАО "Аэрофлот"': 10_000, 'Банк ВТБ (ПАО)': 10_000_000, 'ПАО "Газпром"': 1_000}
srs1 = pd.Series(d1, name='Цена в заявке на покупку, руб.')
srs2 = pd.Series(d2, name='Количество купленных акций, шт.')
# Продолжите написание кода здесь

ser1 = pd.Series(srs1 * srs2)
ser2 = pd.Series(srs1.mul(srs2, fill_value=0))

print(srs1)
print()
print(srs2)
print()
print(ser1)
print()
print(ser2)

ПАО "Газпром"           162.500
Банк ВТБ (ПАО)            0.024
ПАО "Аэрофлот"           36.500
ПАО "Магнит"           6200.000
ПАО "Газпром нефть"     830.000
Name: Цена в заявке на покупку, руб., dtype: float64

ПАО "Аэрофлот"       10000
Банк ВТБ (ПАО)    10000000
ПАО "Газпром"         1000
Name: Количество купленных акций, шт., dtype: int64

Банк ВТБ (ПАО)         240000.0
ПАО "Аэрофлот"         365000.0
ПАО "Газпром нефть"         NaN
ПАО "Газпром"          162500.0
ПАО "Магнит"                NaN
dtype: float64

Банк ВТБ (ПАО)         240000.0
ПАО "Аэрофлот"         365000.0
ПАО "Газпром нефть"         0.0
ПАО "Газпром"          162500.0
ПАО "Магнит"                0.0
dtype: float64

In [19]:
# На вход подается строка, содержащая шесть натуральных чисел, разделенных пробелами.

# На основе этих чисел создайте объект Series.
# Затем возведите в степень значения этой серии таким образом, чтобы первое значение возвелось в первую степень, 
# второе значение - во вторую степень, третье - в третью, четвертое - в четвертую, пятое - в пятую и шестое значение - в шестую степень.
# Выведите полученный объект Series на печать.

# numbers = list(map(int, input().split()))
numbers = [4, 6, 3, 5, 3, 4]

ser = pd.Series(numbers)

print(ser)
print()
print(ser ** (np.arange(len(numbers)) + 1))

0    4
1    6
2    3
3    5
4    3
5    4
dtype: int64

0       4
1      36
2      27
3     625
4     243
5    4096
dtype: int64

# 2.1 Структура данных DataFrame

In [20]:
srs1 = pd.Series([15, 20, 50], name='Количество')
srs2 = pd.Series([200, 450.5, 1800], name='Цена')
print(srs1, srs2, sep='\n\n')

df = pd.DataFrame([srs1, srs2])

display(df)

df = df.T

display(df)

0    15
1    20
2    50
Name: Количество, dtype: int64

0     200.0
1     450.5
2    1800.0
Name: Цена, dtype: float64

                0      1       2
Количество   15.0   20.0    50.0
Цена        200.0  450.5  1800.0

   Количество    Цена
0        15.0   200.0
1        20.0   450.5
2        50.0  1800.0

In [21]:
nda = np.array([[15, 200], [20, 450.5], [50, 1800]])

print(nda)

[[  15.   200. ]
 [  20.   450.5]
 [  50.  1800. ]]

In [22]:
df = pd.DataFrame(nda, columns=['Количество', 'Цена'])

display(df)

   Количество    Цена
0        15.0   200.0
1        20.0   450.5
2        50.0  1800.0

In [23]:
car_sales_values = [['TOYOTA', 'VOLKSWAGEN GROUP', 'GENERAL MOTORS', 'STELLANTIS', 'FORD', 'HONDA', 
              'NISSAN', 'BMW', 'MERCEDES', 'TESLA'],
             [10_483_000, 8_300_000, 5_900_000, 5_800_000, 4_231_000, 4_074_000, 3_225_549,
              2_399_636, 2_043_900, 1_310_000],
             [1_940_000, 3_200_000, 2_300_000, 94_000, 495_000, 1_579_000, 1_045_197,
              791_985, 751_700, 439_770],
             [18.51, 38.55, 38.98, 1.62, 11.7, 38.76, 32.4, 33.0, 36.78, 33.57]]
car_sales_columns = ['Автопроизводитель', 'Продано по всему миру в 1 полугодии 2023', 'Продано в Китае', '%']
car_sales = pd.DataFrame(car_sales_values)
display(car_sales)

,0,1,2,3,4,5,6,7,8,9
0,TOYOTA,VOLKSWAGEN GROUP,GENERAL MOTORS,STELLANTIS,FORD,HONDA,NISSAN,BMW,MERCEDES,TESLA
1,10483000,8300000,5900000,5800000,4231000,4074000,3225549,2399636,2043900,1310000
2,1940000,3200000,2300000,94000,495000,1579000,1045197,791985,751700,439770
3,18.51,38.55,38.98,1.62,11.7,38.76,32.4,33.0,36.78,33.57

In [24]:
moscow_exchange_values = [['2023-03-01', 2279.65, 2258.89, 2287.48, 2255.45, 1.18],
       ['2023-03-02', 2254.3, 2284.87, 2286.27, 2235.43, -1.11],
       ['2023-03-03', 2272.2, 2250.12, 2273.52, 2249.81, 0.79],
       ['2023-03-06', 2294.12, 2286.2, 2297.86, 2283.4, 0.96],
       ['2023-03-07', 2295.6, 2294.32, 2298.93, 2281.46, 0.06],
       ['2023-03-09', 2290.14, 2295.03, 2302.1, 2278.95, -0.24],
       ['2023-03-10', 2276.25, 2272.61, 2283.18, 2266.33, -0.61]]
moscow_exchange_columns = ['Дата', 'Цена', 'Откр.', 'Макс.', 'Мин.', 'Изм. %']
moex = pd.DataFrame(moscow_exchange_values, columns=moscow_exchange_columns)  
# Продолжите написание кода здесь

moex.columns = list(i.lower() for i in moex.columns)

In [25]:
# Добавление нового столбца в датафрейм

brent_values = [['20231002', 92.47, 90.48], ['20231003', 90.48, 91.1],
                ['20231004', 91.1, 86.09], ['20231005', 86.09, 84.18],
                ['20231006', 84.18, 84.47], ['20231008', 84.43, 87.37],
                ['20231009', 87.38, 88.25], ['20231010', 88.25, 87.72],
                ['20231011', 87.72, 85.54], ['20231012', 85.54, 86.26],
                ['20231013', 86.26, 90.94]]
brent_columns = ['date', 'open', 'close']
brent = pd.DataFrame(brent_values, columns=brent_columns)

# Данные для нового
brent_low = pd.Series([90.35, 89.5, 85.75, 83.84, 83.44, 84.43, 86.42, 86.91, 85.21, 85.18, 86.26])

brent['date'] = brent['date'].astype('datetime64[ns]')

display(brent)

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [26]:
# Вставка колонки по индексу
brent.insert(loc=1, column='low', value=brent_low)

display(brent)

         date    low   open  close
0  2023-10-02  90.35  92.47  90.48
1  2023-10-03  89.50  90.48  91.10
2  2023-10-04  85.75  91.10  86.09
3  2023-10-05  83.84  86.09  84.18
4  2023-10-06  83.44  84.18  84.47
5  2023-10-08  84.43  84.43  87.37
6  2023-10-09  86.42  87.38  88.25
7  2023-10-10  86.91  88.25  87.72
8  2023-10-11  85.21  87.72  85.54
9  2023-10-12  85.18  85.54  86.26
10 2023-10-13  86.26  86.26  90.94

In [27]:
# Изменить порядок расположения элементов датафрейма на противоположный:
brent = brent[::-1]
display(brent)

         date    low   open  close
10 2023-10-13  86.26  86.26  90.94
9  2023-10-12  85.18  85.54  86.26
8  2023-10-11  85.21  87.72  85.54
7  2023-10-10  86.91  88.25  87.72
6  2023-10-09  86.42  87.38  88.25
5  2023-10-08  84.43  84.43  87.37
4  2023-10-06  83.44  84.18  84.47
3  2023-10-05  83.84  86.09  84.18
2  2023-10-04  85.75  91.10  86.09
1  2023-10-03  89.50  90.48  91.10
0  2023-10-02  90.35  92.47  90.48

In [28]:
brent.reset_index(drop=True, inplace=True)

display(brent)

         date    low   open  close
0  2023-10-13  86.26  86.26  90.94
1  2023-10-12  85.18  85.54  86.26
2  2023-10-11  85.21  87.72  85.54
3  2023-10-10  86.91  88.25  87.72
4  2023-10-09  86.42  87.38  88.25
5  2023-10-08  84.43  84.43  87.37
6  2023-10-06  83.44  84.18  84.47
7  2023-10-05  83.84  86.09  84.18
8  2023-10-04  85.75  91.10  86.09
9  2023-10-03  89.50  90.48  91.10
10 2023-10-02  90.35  92.47  90.48

In [29]:
# Изменить порядок столбцов
brent = brent[brent.columns[::-1]]
brent

    close   open    low       date
0   90.94  86.26  86.26 2023-10-13
1   86.26  85.54  85.18 2023-10-12
2   85.54  87.72  85.21 2023-10-11
3   87.72  88.25  86.91 2023-10-10
4   88.25  87.38  86.42 2023-10-09
5   87.37  84.43  84.43 2023-10-08
6   84.47  84.18  83.44 2023-10-06
7   84.18  86.09  83.84 2023-10-05
8   86.09  91.10  85.75 2023-10-04
9   91.10  90.48  89.50 2023-10-03
10  90.48  92.47  90.35 2023-10-02

In [30]:
# Параметр mapper метода rename()

brent_values = [['20231002', 92.47, 90.48], ['20231003', 90.48, 91.1],
                ['20231004', 91.1, 86.09], ['20231005', 86.09, 84.18],
                ['20231006', 84.18, 84.47], ['20231008', 84.43, 87.37],
                ['20231009', 87.38, 88.25], ['20231010', 88.25, 87.72],
                ['20231011', 87.72, 85.54], ['20231012', 85.54, 86.26],
                ['20231013', 86.26, 90.94]]
brent_columns = ['date', 'open', 'close']
brent = pd.DataFrame(brent_values, columns=brent_columns)

# Данные для нового
brent_low = pd.Series([90.35, 89.5, 85.75, 83.84, 83.44, 84.43, 86.42, 86.91, 85.21, 85.18, 86.26])

brent['date'] = brent['date'].astype('datetime64[ns]')

display(brent)

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [31]:
brent.rename(str.lower, axis='columns', inplace=True)
brent

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [32]:
brent.rename(mapper=str.upper, axis=1, inplace=True)
brent

         DATE   OPEN  CLOSE
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [33]:
brent.rename(lambda x: x+21, axis=0, inplace=True)

display(brent)

         DATE   OPEN  CLOSE
21 2023-10-02  92.47  90.48
22 2023-10-03  90.48  91.10
23 2023-10-04  91.10  86.09
24 2023-10-05  86.09  84.18
25 2023-10-06  84.18  84.47
26 2023-10-08  84.43  87.37
27 2023-10-09  87.38  88.25
28 2023-10-10  88.25  87.72
29 2023-10-11  87.72  85.54
30 2023-10-12  85.54  86.26
31 2023-10-13  86.26  90.94

# Методы add_prefix() и add_suffix()

In [34]:
brent_values = [['20231002', 92.47, 90.48], ['20231003', 90.48, 91.1],
                ['20231004', 91.1, 86.09], ['20231005', 86.09, 84.18],
                ['20231006', 84.18, 84.47], ['20231008', 84.43, 87.37],
                ['20231009', 87.38, 88.25], ['20231010', 88.25, 87.72],
                ['20231011', 87.72, 85.54], ['20231012', 85.54, 86.26],
                ['20231013', 86.26, 90.94]]
brent_columns = ['date', 'open', 'close']
brent = pd.DataFrame(brent_values, columns=brent_columns)

# Данные для нового
brent_low = pd.Series([90.35, 89.5, 85.75, 83.84, 83.44, 84.43, 86.42, 86.91, 85.21, 85.18, 86.26])

brent['date'] = brent['date'].astype('datetime64[ns]')

display(brent)

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [35]:
brent.add_prefix('brent_')

   brent_date  brent_open  brent_close
0  2023-10-02       92.47        90.48
1  2023-10-03       90.48        91.10
2  2023-10-04       91.10        86.09
3  2023-10-05       86.09        84.18
4  2023-10-06       84.18        84.47
5  2023-10-08       84.43        87.37
6  2023-10-09       87.38        88.25
7  2023-10-10       88.25        87.72
8  2023-10-11       87.72        85.54
9  2023-10-12       85.54        86.26
10 2023-10-13       86.26        90.94

In [36]:
brent.add_suffix('_brent')

   date_brent  open_brent  close_brent
0  2023-10-02       92.47        90.48
1  2023-10-03       90.48        91.10
2  2023-10-04       91.10        86.09
3  2023-10-05       86.09        84.18
4  2023-10-06       84.18        84.47
5  2023-10-08       84.43        87.37
6  2023-10-09       87.38        88.25
7  2023-10-10       88.25        87.72
8  2023-10-11       87.72        85.54
9  2023-10-12       85.54        86.26
10 2023-10-13       86.26        90.94

In [37]:
brent.add_prefix('asd_', axis=0)

             date   open  close
asd_0  2023-10-02  92.47  90.48
asd_1  2023-10-03  90.48  91.10
asd_2  2023-10-04  91.10  86.09
asd_3  2023-10-05  86.09  84.18
asd_4  2023-10-06  84.18  84.47
asd_5  2023-10-08  84.43  87.37
asd_6  2023-10-09  87.38  88.25
asd_7  2023-10-10  88.25  87.72
asd_8  2023-10-11  87.72  85.54
asd_9  2023-10-12  85.54  86.26
asd_10 2023-10-13  86.26  90.94

In [38]:
brent = brent.set_index('date')

brent.T

date,2023-10-02,2023-10-03,2023-10-04,2023-10-05,2023-10-06,2023-10-08,2023-10-09,2023-10-10,2023-10-11,2023-10-12,2023-10-13
open,92.47,90.48,91.10,86.09,84.18,84.43,87.38,88.25,87.72,85.54,86.26
close,90.48,91.10,86.09,84.18,84.47,87.37,88.25,87.72,85.54,86.26,90.94

# 2.3 Доступ к данным

In [39]:
data = [['2023-06-01',122.820000,124.419998,122.620003,123.720001],
['2023-06-02',123.989998,126.150002,123.760002,124.669998],
['2023-06-05',124.010002,127.430000,123.839996,126.010002],
['2023-06-06',126.010002,128.289993,125.360001,127.309998],
['2023-06-07',126.970001,129.039993,122.120003,122.500000],
['2023-06-08',122.230003,123.230003,121.239998,122.139999],
['2023-06-09',122.250000,123.760002,121.910004,122.230003],
['2023-06-12',122.790001,124.050003,121.660004,123.639999],
['2023-06-13',124.980003,125.160004,123.180000,123.830002],
['2023-06-14',123.099998,124.050003,121.449997,123.669998],
['2023-06-15',123.139999,125.459999,122.400002,125.089996],
['2023-06-16',125.930000,126.110001,123.279999,123.529999]]
col = ['date','open','high','low','close']

google = pd.DataFrame(data, columns=col)
google['date'] = pd.to_datetime(google['date'])

google

         date        open        high         low       close
0  2023-06-01  122.820000  124.419998  122.620003  123.720001
1  2023-06-02  123.989998  126.150002  123.760002  124.669998
2  2023-06-05  124.010002  127.430000  123.839996  126.010002
3  2023-06-06  126.010002  128.289993  125.360001  127.309998
4  2023-06-07  126.970001  129.039993  122.120003  122.500000
5  2023-06-08  122.230003  123.230003  121.239998  122.139999
6  2023-06-09  122.250000  123.760002  121.910004  122.230003
7  2023-06-12  122.790001  124.050003  121.660004  123.639999
8  2023-06-13  124.980003  125.160004  123.180000  123.830002
9  2023-06-14  123.099998  124.050003  121.449997  123.669998
10 2023-06-15  123.139999  125.459999  122.400002  125.089996
11 2023-06-16  125.930000  126.110001  123.279999  123.529999

In [40]:
gold_values = [['J2TX.ALLFUTGOLD', 'M', '20220101', 0, 1830.1, 1854.2, 1778.8, 1800.0, 3141758],
               ['J2TX.ALLFUTGOLD', 'M', '20220201', 0, 1800.1, 1976.5, 1788.5, 1907.3, 3667293],
               ['J2TX.ALLFUTGOLD', 'M', '20220301', 0, 1907.3, 2078.8, 1888.3, 1943.1, 3779219],
               ['J2TX.ALLFUTGOLD', 'M', '20220401', 0, 1943.0, 2003.0, 1870.9, 1896.9, 2922701],
               ['J2TX.ALLFUTGOLD', 'M', '20220501', 0, 1896.2, 1910.7, 1785.0, 1839.0, 2807625],
               ['J2TX.ALLFUTGOLD', 'M', '20220601', 0, 1838.9, 1882.5, 1801.1, 1801.5, 3045238],
               ['J2TX.ALLFUTGOLD', 'M', '20220701', 0, 1801.5, 1815.2, 1678.4, 1778.0, 2814156],
               ['J2TX.ALLFUTGOLD', 'M', '20220801', 0, 1777.9, 1824.6, 1713.0, 1715.2, 3019818],
               ['J2TX.ALLFUTGOLD', 'M', '20220901', 0, 1715.4, 1746.4, 1622.2, 1668.3, 3896802],
               ['J2TX.ALLFUTGOLD', 'M', '20221001', 0, 1670.5, 1738.7, 1621.1, 1640.4, 3449294],
               ['J2TX.ALLFUTGOLD', 'M', '20221101', 0, 1640.5, 1793.8, 1618.3, 1793.4, 3360941],
               ['J2TX.ALLFUTGOLD', 'M', '20221201', 0, 1793.3, 1841.9, 1778.1, 1830.1, 2841688],
               ['J2TX.ALLFUTGOLD', 'M', '20230101', 0, 1831.8, 1949.8, 1829.9, 1941.4, 3160947]]
gold_columns = ['<TICKER>', '<PER>', '<DATE>', '<TIME>', '<OPEN>', '<HIGH>', '<LOW>', '<CLOSE>', '<VOL>']
gold = pd.DataFrame(gold_values, columns=gold_columns)
# Продолжите написание кода здесь

print(gold[['<DATE>', '<CLOSE>']])

      <DATE>  <CLOSE>
0   20220101   1800.0
1   20220201   1907.3
2   20220301   1943.1
3   20220401   1896.9
4   20220501   1839.0
5   20220601   1801.5
6   20220701   1778.0
7   20220801   1715.2
8   20220901   1668.3
9   20221001   1640.4
10  20221101   1793.4
11  20221201   1830.1
12  20230101   1941.4

In [41]:
moscow_exchange_values = [['2023-03-10', 2276.25, 2272.61, 2283.18, 2266.33, -0.61],
       ['2023-03-09', 2290.14, 2295.03, 2302.1, 2278.95, -0.24],
       ['2023-03-07', 2295.6, 2294.32, 2298.93, 2281.46, 0.06],
       ['2023-03-06', 2294.12, 2286.2, 2297.86, 2283.4, 0.96],
       ['2023-03-03', 2272.2, 2250.12, 2273.52, 2249.81, 0.79],
       ['2023-03-02', 2254.3, 2284.87, 2286.27, 2235.43, -1.11],
       ['2023-03-01', 2279.65, 2258.89, 2287.48, 2255.45, 1.18]]
moscow_exchange_columns = ['Дата', 'Цена', 'Откр.', 'Макс.', 'Мин.', 'Изм. %']
moex = pd.DataFrame(moscow_exchange_values, columns=moscow_exchange_columns)  
# Продолжите написание кода здесь

moex = moex[::-1].reset_index().drop('index', axis=1)
moex

         Дата     Цена    Откр.    Макс.     Мин.  Изм. %
0  2023-03-01  2279.65  2258.89  2287.48  2255.45    1.18
1  2023-03-02  2254.30  2284.87  2286.27  2235.43   -1.11
2  2023-03-03  2272.20  2250.12  2273.52  2249.81    0.79
3  2023-03-06  2294.12  2286.20  2297.86  2283.40    0.96
4  2023-03-07  2295.60  2294.32  2298.93  2281.46    0.06
5  2023-03-09  2290.14  2295.03  2302.10  2278.95   -0.24
6  2023-03-10  2276.25  2272.61  2283.18  2266.33   -0.61

# 2.4 loc

In [72]:
# Сделайте столбец 'Дата' индексом.
# Транспонируйте датафрейм.
# Выведите на печать данные из столбца '2023-03-01' в виде объекта Series.
# Распечатайте пустую строку. 
# Выведите на печать данные по двум столбцам '2023-03-01' и '2023-03-06'.

moscow_exchange_values = [['2023-03-01', 2279.65, 2258.89, 2287.48, 2255.45, 1.18],
       ['2023-03-02', 2254.3, 2284.87, 2286.27, 2235.43, -1.11],
       ['2023-03-03', 2272.2, 2250.12, 2273.52, 2249.81, 0.79],
       ['2023-03-06', 2294.12, 2286.2, 2297.86, 2283.4, 0.96],
       ['2023-03-07', 2295.6, 2294.32, 2298.93, 2281.46, 0.06],
       ['2023-03-09', 2290.14, 2295.03, 2302.1, 2278.95, -0.24],
       ['2023-03-10', 2276.25, 2272.61, 2283.18, 2266.33, -0.61]]
moscow_exchange_columns = ['Дата', 'Цена', 'Откр.', 'Макс.', 'Мин.', 'Изм. %']
moex = pd.DataFrame(moscow_exchange_values, columns=moscow_exchange_columns)  
# Продолжите написание кода здесь

moex = moex.set_index('Дата').T
print(moex['2023-03-01'])
print()
print(moex.loc[:,['2023-03-01', '2023-03-06']])

Цена      2279.65
Откр.     2258.89
Макс.     2287.48
Мин.      2255.45
Изм. %       1.18
Name: 2023-03-01, dtype: float64

Дата    2023-03-01  2023-03-06
Цена       2279.65     2294.12
Откр.      2258.89     2286.20
Макс.      2287.48     2297.86
Мин.       2255.45     2283.40
Изм. %        1.18        0.96

In [92]:
# Создайте датафрейм, содержащий показатели за 2022 год, и в котором будут только два столбца - 'Дата выпуска' и 'Факт.'.
# "Переверните" датафрейм, чтобы показатели начинались с января 2022 г.
# Индексация должна идти с нуля.
# Выведите итоговый датафрейм на печать.

pmi_services_germany_values = [['05.07.2023 (июнь)', 54.1, 54.1, 57.2],
       ['05.06.2023 (май)', 57.2, 57.8, 56.0], ['04.05.2023 (апр)', 56.0, 55.7, 53.7],
       ['05.04.2023 (мар)', 53.7, 53.9, 50.9], ['03.03.2023 (фев)', 50.9, 51.3, 50.7],
       ['03.02.2023 (янв)', 50.7, 50.4, 49.2], ['04.01.2023 (дек)', 49.2, 49.0, 46.1],
       ['05.12.2022 (нояб)', 46.1, 46.4, 46.5], ['04.11.2022 (окт)', 46.5, 44.9, 45.0],
       ['05.10.2022 (сент)', 45.0, 45.4, 47.7], ['05.09.2022 (авг)', 47.7, 48.2, 49.7],
       ['03.08.2022 (июль)', 49.7, 49.2, 52.4], ['05.07.2022 (июнь)', 52.4, 52.4, 55.0],
       ['03.06.2022 (май)', 55.0, 56.3, 56.3], ['04.05.2022 (апр)', 57.6, 57.9, 56.1],
       ['05.04.2022 (мар)', 56.1, 55.0, 55.8], ['03.03.2022 (фев)', 55.8, 56.6, 52.2],
       ['03.02.2022 (янв)', 52.2, 52.2, 48.7], ['05.01.2022 (дек)', 48.7, 48.4, 52.7],
       ['03.12.2021 (нояб)', 52.7, 53.4, 52.4], ['04.11.2021 (окт)', 52.4, 52.4, 56.2],
       ['05.10.2021 (сент)', 56.2, 56.0, 60.8], ['03.09.2021 (авг)', 60.8, 61.5, 61.8],
       ['04.08.2021 (июль)', 61.8, 62.2, 57.5], ['05.07.2021 (июнь)', 57.5, 58.1, 52.8],
       ['03.06.2021 (май)', 52.8, 52.8, 52.8], ['05.05.2021 (апр)', 49.9, 50.1, 51.5],
       ['07.04.2021 (мар)', 51.5, 50.8, 45.7], ['03.03.2021 (фев)', 45.7, 45.9, 46.7],
       ['03.02.2021 (янв)', 46.7, 46.8, 46.8]]
pmi_services_germany_columns = ['Дата выпуска', 'Факт.', 'Прогноз', 'Пред.']
pmi_services_germany = pd.DataFrame(pmi_services_germany_values, 
                                        columns=pmi_services_germany_columns)
# Продолжите написание кода здесь
pmi_services_germany = pmi_services_germany.loc[6:17, ['Дата выпуска', 'Факт.']][::-1].reset_index(drop='index')
pmi_services_germany

         Дата выпуска  Факт.
0    03.02.2022 (янв)   52.2
1    03.03.2022 (фев)   55.8
2    05.04.2022 (мар)   56.1
3    04.05.2022 (апр)   57.6
4    03.06.2022 (май)   55.0
5   05.07.2022 (июнь)   52.4
6   03.08.2022 (июль)   49.7
7    05.09.2022 (авг)   47.7
8   05.10.2022 (сент)   45.0
9    04.11.2022 (окт)   46.5
10  05.12.2022 (нояб)   46.1
11   04.01.2023 (дек)   49.2

In [96]:
# Используя loc добавьте новую строчку в конец датафрейма, содержащую следующие данные: 
# 'Golden Silver Bank', 500_000_000, 8.20, 'O/N'. Выведите итоговый датафрейм на печать.

depo_values = [['New Energy Bank', 1_000_000_000, 8.30, 'O/N'],
               ['AgroFoodBank', 5_000_000_000, 8.50, '1W'],
               ['First Ecologic Bank', 4_500_000_000, 8.60, '1M'],
               ['Cryptocurrencybank', 2_700_000_000, 8.30, 'O/N'],
               ['GreenEnergyBank', 1_800_000_000, 8.35, 'O/N'],
               ['ClearWaterBank', 3_000_000_000, 8.40, 'O/N'],
               ['First Ecologic Bank', 3_000_000_000, 8.41, 'O/N'],
               ['Cryptocurrencybank', 7_500_000_000, 8.50, 'O/N'],
               ['Golden Silver Bank', 2_500_000_000, 8.65, '1M'],
               ['New Energy Bank', 2_000_000_000, 8.45, '1W'],
               ['AgroFoodBank', 700_000_000, 8.25, 'O/N'],
               ['Golden Silver Bank', 4_300_000_000, 8.40, 'O/N'],
               ['New Energy Bank', 4_000_000_000, 8.80, '3M']]
depo_columns = ['Банк', 'Сумма, руб.', 'Ставка', 'Срок']
depo = pd.DataFrame(depo_values, columns=depo_columns)
# Продолжите написание кода здесь

depo.loc[len(depo)] = ['Golden Silver Bank', 500_000_000, 8.20, 'O/N']
depo

                   Банк  Сумма, руб.  Ставка Срок
0       New Energy Bank   1000000000    8.30  O/N
1          AgroFoodBank   5000000000    8.50   1W
2   First Ecologic Bank   4500000000    8.60   1M
3    Cryptocurrencybank   2700000000    8.30  O/N
4       GreenEnergyBank   1800000000    8.35  O/N
5        ClearWaterBank   3000000000    8.40  O/N
6   First Ecologic Bank   3000000000    8.41  O/N
7    Cryptocurrencybank   7500000000    8.50  O/N
8    Golden Silver Bank   2500000000    8.65   1M
9       New Energy Bank   2000000000    8.45   1W
10         AgroFoodBank    700000000    8.25  O/N
11   Golden Silver Bank   4300000000    8.40  O/N
12      New Energy Bank   4000000000    8.80   3M
13   Golden Silver Bank    500000000    8.20  O/N

# 2.5 iloc

In [123]:
df = depo[0:9]
depo.iloc[0:3]

                  Банк  Сумма, руб.  Ставка Срок
0      New Energy Bank   1000000000     8.3  O/N
1         AgroFoodBank   5000000000     8.5   1W
2  First Ecologic Bank   4500000000     8.6   1M

In [116]:
# Каждая пятая строчка
df[::5]
df.loc[[0,5]]
df.loc[::5]
df.iloc[[0,5]]
df.iloc[::5]

              Банк  Сумма, руб.  Ставка Срок
0  New Energy Bank   1000000000     8.3  O/N
5   ClearWaterBank   3000000000     8.4  O/N

In [ ]:
# 2.6 Методы filter, isin, where, query